article/rename-many-files.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-22 Sat 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>批量规范化重命名大量的文件</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">批量规范化重命名大量的文件</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd911138">1. 使用 vim 和 find 进行命名</a>
<ul>
<li><a href="#org0480d32">1.1. 第一步</a></li>
<li><a href="#org7d4e61c">1.2. 第二步</a></li>
</ul>
</li>
<li><a href="#orga3a2239">2. 使用 emacs 的 dired 进行重命名</a></li>
</ul>
</div>
</div>
<p>
大量修改文件名非常麻烦，本人曾经不厌其烦地用 Windows 文件管理器点开一个个文件夹
后修改文件名，非常苦逼。自从用了 EMACS 的 dired 模式过后就回不去了，但是一些服务
器上往往没有安装 EMACS，所以可以总结下面的发放来批量修改文件名。
</p>

<div id="outline-container-orgd911138" class="outline-2">
<h2 id="orgd911138"><span class="section-number-2">1</span> 使用 vim 和 find 进行命名</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0480d32" class="outline-3">
<h3 id="org0480d32"><span class="section-number-3">1.1</span> 第一步</h3>
<div class="outline-text-3" id="text-1-1">
<p>
将需要修改的文件名全面找到放到 /tmp 目录下的两个文件里面，文件 a 里面存放原来的文
件名，文件 b 通过 vim 编辑成修改后的文件。注意文件 a 里面的文件名或者目录名的空格
需要转义。
</p>
<div class="org-src-container">
<pre class="src src-sh">find . -type f -iname <span style="color: #2aa198;">'*.txt'</span> | tee /tmp/b | sed <span style="color: #2aa198;">'s/ /\\ /'</span> &gt; /tmp/a
vim /tmp/b
</pre>
</div>

<p>
或者使用下面的命令，在 find 找到的文件前后添加单引号
</p>
<div class="org-src-container">
<pre class="src src-sh">find . -type f -iname <span style="color: #2aa198;">'*.txt'</span> | tee /tmp/b | sed <span style="color: #2aa198;">"s/$/'/"</span> | sed <span style="color: #2aa198;">"s/^/'/"</span> &gt; /tmp/a
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d4e61c" class="outline-3">
<h3 id="org7d4e61c"><span class="section-number-3">1.2</span> 第二步</h3>
<div class="outline-text-3" id="text-1-2">
<p>
编辑好文件/tmp/b 保存后用下面命令批量重命名。
</p>
<div class="org-src-container">
<pre class="src src-sh">paste /tmp/a /tmp/b | xargs -n 2 mv
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga3a2239" class="outline-2">
<h2 id="orga3a2239"><span class="section-number-2">2</span> 使用 emacs 的 dired 进行重命名</h2>
<div class="outline-text-2" id="text-2">
<p>
emacs 的 dired-mode 可以直接浏览文件，使用 wired-dired-mode 可以绑定当前目录的
文件到当前的 dired 的 buffer 上，然后使用 query-replace 替换文件名后，使用
<code>"C-c C-c"</code> 应用修改。
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #8d5649;">(</span>wdired-change-to-wdired-mode<span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">C-c C-q</span>
<span style="color: #8d5649;">(</span>wdired-finish-edit<span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">C-c C-c</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-02-22 Sat 19:24. Created by Jinghui Hu at 2018-10-05 Fri 11:04.</p>
</div>
</body>
</html>
